app/controllers/email_controller.rb

SELECT "emails".* FROM "emails" ORDER BY "emails"."created_at" ASC
---
  def index
    @email = Email.all

INSERT INTO "emails" ("object", "body", "created_at", "updated_at", "read") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["object", "Ansel Adams"], ["body", "Wow, Bob, wow."], ["created_at", "2020-05-29 17:21:24.431856"], ["updated_at", "2020-05-29 17:21:24.431856"], ["read", false]]
---
  def create
    @email = Email.new(object: Faker::Artist.name, body: Faker::TvShows::TwinPeaks.quote, read: false)

    if @email.save

SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-05-28 20:32:38.862316"], ["id", 5]]
---
  def update
    @email = Email.find(params[:id])
    @email.toggle(:read).save